ХМНПФ_Общее/DataProcessors/уп_ФормированиеРешенийФонда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ФормированиеРешенийФонда</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_ПричиныЗакрытияДоговоровОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПричиныЗакрытияДоговоровОПС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПричинаЗакрытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ПричиныЗакрытияДоговораОПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/AccumulationRegisters/уп_РезервыОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_РезервыОПС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаКомпенсации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаВосполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаВозмещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Движение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уп_ДокументРегистрации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидДвиженияЕПС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.епс_ВидыДвиженияПенсионныхНакоплений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ТипыСуммОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипРезерва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыРезервовОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_ПричиныЗакрытияДоговораОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПричиныЗакрытияДоговораОПС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоСмерти</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Досрочное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакрытПоОтказуИзПФР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АннулированиеЛицензии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиновременнаяВыплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеВступилВСилу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоРешениюСуда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПереходДосрочный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоИнымПричинам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбъединениеСНИЛС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_ПереносСредствНаДругойДоговорФизЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_НазначенаВыплатаПредыдущимСтраховщиком</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_ТипыРезервовОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ТипыРезервовОПС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервПенсионныйНакоплений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервСрочнойВыплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Выплатной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервЕВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийНП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийСВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийЕВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийРасторжение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийНаследованиеРПН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийНаследованиеРСВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийНаследованиеРОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийВозвратМСКРПН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийВозвратМСКРСВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНаследниковРПН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНаследниковРСВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийРазделениеСНИЛС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/DataProcessors/уп_ФормированиеРешенийФонда/Forms/ФормаУправляемая/Ext/Form/Module.bsl
// ХМНПФ 18.04.2016 ШадринАВ // Новая ХМ_СформироватьРешения() // №318
&НаСервере
Процедура ХМ_СформироватьРешения()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПричиныЗакрытияДоговоровОПС.ДоговорОПС КАК ДоговорОПС
		|ПОМЕСТИТЬ Договора
		|ИЗ
		|	РегистрСведений.уп_ПричиныЗакрытияДоговоровОПС.СрезПоследних(&ДатаРешения, ) КАК ПричиныЗакрытияДоговоровОПС
		|ГДЕ
		|	ПричиныЗакрытияДоговоровОПС.ПричинаЗакрытия = ЗНАЧЕНИЕ(Перечисление.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти)
		|	И ПричиныЗакрытияДоговоровОПС.ДоговорОПС.Участник.уп_ФизЛицо.уп_ДатаСмерти <= &ДатаКон6мес
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ПричиныЗакрытияДоговоровОПС.ДоговорОПС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РешениеОВыплатеСПН.Заявление.ДоговорОПС КАК ДоговорОПС
		|ПОМЕСТИТЬ РешенияОВыплатеСПН
		|ИЗ
		|	Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений.Заявления КАК РешениеОВыплатеСПН
		|ГДЕ
		|	РешениеОВыплатеСПН.Ссылка.Проведен
		|	И РешениеОВыплатеСПН.Разрешить
		|	И РешениеОВыплатеСПН.Ссылка.ДоговорОПС В
		|			(ВЫБРАТЬ
		|				Договора.ДоговорОПС
		|			ИЗ
		|				Договора КАК Договора)
		|	И ГОД(РешениеОВыплатеСПН.Ссылка.Дата) < ГОД(&ДатаРешения)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РешениеОВыплатеСПН.Заявление.ДоговорОПС
		|ИЗ
		|	Документ.уп_РешениеОВыплатеСредствПенсионныхНакоплений.Правопреемники31 КАК РешениеОВыплатеСПН
		|ГДЕ
		|	РешениеОВыплатеСПН.Ссылка.Проведен
		|	И РешениеОВыплатеСПН.Разрешить
		|	И РешениеОВыплатеСПН.Ссылка.ДоговорОПС В
		|			(ВЫБРАТЬ
		|				Договора.ДоговорОПС
		|			ИЗ
		|				Договора КАК Договора)
		|	И ГОД(РешениеОВыплатеСПН.Ссылка.Дата) < ГОД(&ДатаРешения)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РезервыОПСОстатки.Организация КАК Организация,
		|	РезервыОПСОстатки.ДоговорОПС КАК ДоговорОПС,
		|	РезервыОПСОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.уп_РезервыОПС.Остатки(
		|			&ДатаРешения,
		|			ТипРезерва В (&ТипыРезервовОПС)
		|				И ДоговорОПС В
		|					(ВЫБРАТЬ
		|						Договора.ДоговорОПС
		|					ИЗ
		|						Договора КАК Договора)) КАК РезервыОПСОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РешенияОВыплатеСПН КАК РешенияОВыплатеСПН
		|		ПО (РешенияОВыплатеСПН.ДоговорОПС = РезервыОПСОстатки.ДоговорОПС)
		|ГДЕ
		|	РезервыОПСОстатки.СуммаОстаток > 0";
	
		//|	И (ПричиныЗакрытияДоговоровОПС.ДоговорОПС.Участник.уп_ФизЛицо.уп_ДатаСмерти < &ДатаНач
		//|			ИЛИ ПричиныЗакрытияДоговоровОПС.ДоговорОПС.Участник.уп_ФизЛицо.уп_ДатаСмерти МЕЖДУ &ДатаКон И &ДатаКон6мес)
	
	//ДатаНач = НачалоГода(ДобавитьМесяц(НачалоГода(ДатаРешения)-(24*60*60),-12));
	ДатаКон = КонецГода(ДобавитьМесяц(НачалоГода(Объект.ДатаРешения)-(24*60*60),-12))+1;
	ДатаКон6мес = КонецМесяца(ДобавитьМесяц(ДатаКон,6));
	ТипыРезервовОПС = Новый СписокЗначений;
	ТипыРезервовОПС.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений);
	ТипыРезервовОПС.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервСрочнойВыплаты);
	ТипыРезервовОПС.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРПН);
	ТипыРезервовОПС.Добавить(Перечисления.уп_ТипыРезервовОПС.РезервНаследниковРСВ);
	
	//Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	//Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	//Запрос.УстановитьПараметр("ПоСмерти", Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти);
	Запрос.УстановитьПараметр("ДатаКон6мес", ДатаКон6мес);
	Запрос.УстановитьПараметр("ДатаРешения", Объект.ДатаРешения);
	Запрос.УстановитьПараметр("ТипыРезервовОПС", ТипыРезервовОПС);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	    СоздатьДокумент(Выборка.ДоговорОПС, Выборка.СуммаОстаток);
	КонецЦикла;
КонецПроцедуры

// ХМНПФ 18.04.2016 ШадринАВ // Новая ХМ_УстановитьДействияФормы()
&НаСервере
Процедура ХМ_УстановитьДействияФормы()
	УстановитьДействие("ПриОткрытии", "ХМ_ПриОткрытии");
КонецПроцедуры

// ХМНПФ 18.04.2016 ШадринАВ // Новая ХМ_УстановитьДействияФормы()
&НаКлиенте
Процедура ХМ_ПриОткрытии()
	 ХМ_ПриОткрытииСервер();
КонецПроцедуры

// ХМНПФ 18.04.2016 ШадринАВ // Новая ХМ_ПриОткрытииСервер() // №318
&НаСервере
Процедура ХМ_ПриОткрытииСервер()
	Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
	НоваяКоманда = ЭтаФорма.Команды.Добавить("ХМ_Провести");
	НоваяКоманда.Действие = "ХМ_Провести";
	НоваяКоманда.Заголовок = "Провести";
	
	НовыйЭлемент = Элементы.Добавить("ХМ_Провести", Тип("КнопкаФормы"),Элементы.Группа4);
	НовыйЭлемент.ИмяКоманды = "ХМ_Провести";
	НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НовыйЭлемент.Картинка = БиблиотекаКартинок.ЖурналПроводок;
	НовыйЭлемент.Отображение = ОтображениеКнопки.КартинкаИТекст;
КонецПроцедуры

// ХМНПФ 18.04.2016 ШадринАВ // Новая ХМ_Провести() // №318
&НаКлиенте
Процедура ХМ_Провести()
	ХМ_ПровестиСервер();
КонецПроцедуры

// ХМНПФ 18.04.2016 ШадринАВ // Новая ХМ_ПровестиСервер() // №318
&НаСервере
Процедура ХМ_ПровестиСервер()
	Для каждого стр из Объект.НовыеНачисления Цикл
		Док = стр.Документ.ПолучитьОбъект();
		Попытка
			Док.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 18.04.2016 ШадринАВ // КнопкаВыполнитьНажатие() // №318
	// ХМНПФ 18.04.2016 ШадринАВ // Новая ХМ_СформироватьРешения() // №318
	// ХМНПФ 18.04.2016 ШадринАВ // Новая ХМ_Провести() // №318
	// ХМНПФ 18.04.2016 ШадринАВ // Новая ХМ_ПровестиСервер() // №318	
	// ХМНПФ 18.04.2016 ШадринАВ // ПриСозданииНаСервере()
	// ХМНПФ 18.04.2016 ШадринАВ // Новая ХМ_УстановитьДействияФормы()
	// ХМНПФ 18.04.2016 ШадринАВ // Новая ХМ_ПриСозданииНаСервере()	
КонецПроцедуры


&НаСервере
Процедура ХМПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// ХМНПФ 18.04.2016 ШадринАВ // ПриСозданииНаСервере
	ХМ_УстановитьДействияФормы();
	// ХМНПФ 18.04.2016 ШадринАВ // ПриСозданииНаСервере
КонецПроцедуры


&НаСервере
&ИзменениеИКонтроль("СформироватьНаСервере")
Процедура ХМСформироватьНаСервере()
	Если Объект.ДополнительнаяВыплата Тогда
		ДатаНач = НачалоГода(ДобавитьМесяц(НачалоГода(Объект.ДатаРешения)-(24*60*60),-12));
		ДатаКон = КонецГода(ДобавитьМесяц(НачалоГода(Объект.ДатаРешения)-(24*60*60),-12));
	Иначе
		ДатаНач = НачалоМесяца(ДобавитьМесяц(Объект.ДатаРешения,-7));
		ДатаКон = КонецМесяца(ДобавитьМесяц(Объект.ДатаРешения,-7));
	КонецЕсли;	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПричиныЗакрытияДоговоровОПС.ДоговорОПС
	|ИЗ
	|	РегистрСведений.уп_ПричиныЗакрытияДоговоровОПС.СрезПоследних(&ДатаРешения, ДоговорОПС.Организация = &Организация) КАК ПричиныЗакрытияДоговоровОПС
	|ГДЕ
	|	ПричиныЗакрытияДоговоровОПС.ПричинаЗакрытия = &ПоСмерти
	|	И ПричиныЗакрытияДоговоровОПС.ДоговорОПС.Участник.уп_ФизЛицо.уп_ДатаСмерти >= &ДатаНач
	|	И ПричиныЗакрытияДоговоровОПС.ДоговорОПС.Участник.уп_ФизЛицо.уп_ДатаСмерти <= &ДатаКон";

	Запрос.УстановитьПараметр("ПоСмерти", Перечисления.уп_ПричиныЗакрытияДоговораОПС.ПоСмерти);
	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	Запрос.УстановитьПараметр("ДатаРешения", Объект.ДатаРешения);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	ТЗ = Результат.Выгрузить();

	Элементы.Сформировать.Доступность = Ложь;
	Элементы.Отменить.Доступность = Истина;
	Элементы.Применить.Доступность = Истина;
	ЕстьНеутвержденныеДокументы = Истина;
	Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.ОсновнаяПанель.ПодчиненныеЭлементы.Получить(0);

	#Вставка
	// +ХМНПФ 18.04.2016 ШадринАВ // КнопкаВыполнитьНажатие() // №318
	//--СформироватьРешения(ТЗ);
	Если Объект.ДополнительнаяВыплата Тогда
		ХМ_СформироватьРешения();
	Иначе 
	#КонецВставки
	СформироватьРешения(ТЗ);
	#Вставка
	КонецЕсли;	
	// -ХМНПФ 18.04.2016 ШадринАВ // КнопкаВыполнитьНажатие() // №318  
	#КонецВставки
	
КонецПроцедуры
